[
{"title":"Aether Tunnel","color":"blue","lowScore":"2.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"This is an neat finisher for aggressive blue decks-it basically guarantees one hit, and if it isn't answered it clocks the opponent quickly. I'm glad it's an uncommon, as the joke would get old at common. Not every deck will want this, but those that do will take it as if it were a 3.0 or 3.5-it's situational but quite powerful.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Aether Tunnel.png"},
{"title":"Anticipate","color":"blue","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"Like Opt, this is the kind of card that will often end up on the chopping block because it doesn't do anything. It's a good way to spend turn 2 in a deck without low drops, and it smooths out your draws, but you won't always have space for it. Unlike Opt in Dominaria, there isn't a heavy spells-matter component, which is why Opt ended up being much stronger in that format. I anticipate playing this most of the time.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Anticipate.png"},
{"title":"Aven Wind Mage","color":"blue","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Of course, the next card I talk about cares about spells, but this really isn't a major theme of the set. The Wind Mage is a solid card, and demonstrates its prowess best in an aggressive deck. A 2/2 flyer for 3 is a good enough deal that you don't really need spells to justify playing this, though it becomes awesome in a spell-heavy deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Aven Wind Mage.png"},
{"title":"Aviation Pioneer","color":"blue","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This is a solid little common. It gets better in artifact-matters decks, but is totally acceptable to just put in your deck regardless of what else you have going on. Two bodies, one of which flies, is a great deal for 3 mana, and I'm going to be happy casting a lot of these. It combos with bounce, ways to get creatures back, and even edges into the sacrifice theme that red has going on.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Aviation Pioneer.png"},
{"title":"Bone to Ash","color":"blue","lowScore":"1.5","highScore":"","set":"m19","rarity":"uncommon","instant":"instant","removal":"","face":"","fixing":"","review":"I'm going to start at 1.5 for this because it is a 4 mana situational counterspell. Leaving this up on turns 4-6 and having the opponent tap out for a noncreature spell can lose you the game on the spot, and if the format is fast, you often won't have the luxury of leaving it up to begin with. That said, it's powerful in a slow format or in slow matchups, and it definitely will have a place. I'm cool on this to start, but I have my eye on it-Bone to Ash could easily end up being a solid main deck card. I also like the card in Sealed, so you should main deck it there.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Bone to Ash.png"},
{"title":"Cancel","color":"blue","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"I'm less high on Cancel because the payoff isn't there. Paying 3 mana to trade 1-for-1 isn't a huge upside, and the risk of the opponent not playing into this or playing something mediocre is a big one. The slower the format, the better this gets, but it's never been amazing and it's been printed 50 times.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Cancel.png"},
{"title":"Departed Deckhand","color":"blue","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"A nearly unblockable 2/2 for 2 is fantastic, and this even has the ability to make other creatures unblockable. It does die to a stiff breeze, but most spells that target will have killed this anyway, so I don't see that as a huge drawback. This is great early as a clock, and great late as a way to get a ton of damage in out of nowhere. The only thing I don't like is that it makes me keep track of which creatures are Spirits, even in games where that doesn't seem like it is a relevant piece of information.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Departed Deckhand.png"},
{"title":"Disperse","color":"blue","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"removal","face":"","fixing":"","review":"The fewer ways your deck has to interact, the better this becomes. It's marginal in a deck with 3+ removal spells, but necessary in one with none. Being down a card isn't great, but this does fight Auras, combat tricks, and can help push through damage if your deck is fast enough.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Disperse.png"},
{"title":"Divination","color":"blue","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I'm not in the business of cutting Divination from my Draft decks. This smooths out your draws, puts you up a card, and is cheap enough that it fits in almost any deck. If you are very aggressive, you can cut this, but otherwise you really shouldn't (and I'm not only saying that because I'm somewhat fond of the card).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Divination.png"},
{"title":"Djinn of Wishes","color":"blue","lowScore":"4.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Djinn of Wishes is one of my all-time favorite cards, mostly because the flavor captures three wishes so well. You are getting 3 cards, even if they aren't exactly what you asked for, and that's on top of a 4/4 flyer for 5. I hope you wish for something good, but even if you miss, you'll probably be OK.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Djinn of Wishes.png"},
{"title":"Dwindle","color":"blue","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"removal","face":"","fixing":"","review":"This is an odd version of Deep Freeze, but at least the creature can't really be used to block all that well. I like including this in controlling blue decks and those with flyers, though it's passable in blue decks that attack on the ground if you need some interaction.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Dwindle.png"},
{"title":"Essence Scatter","color":"blue","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"The difference between 2 and 3 mana on a counterspell is huge, and that's why Essence Scatter gets an \"always play\" grade and Cancel is marginal at best. It's odd seeing this, Cancel, and Bone to Ash all here, but that doesn't change my desire to take and play Essence Scatter.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Essence Scatter.png"},
{"title":"Exclusion Mage","color":"blue","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"removal","face":"","fixing":"","review":"This ability is now apparently excluded from being common, which may be for the best. Getting this at 3 mana is a rare (uncommon?) treat, and it fits into any blue deck regardless of how aggressive or controlling it is. This helps you come back when behind and really puts you ahead if you have the upper hand, so take it early and take it often.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Exclusion Mage.png"},
{"title":"Frilled Sea Serpent","color":"blue","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"While the name may lack flair, this card certainly doesn't. It blocks well and can close out the game when needed, making it a card I want one of in any control deck. It's not even the worst aggro finisher in the world, though I wouldn't prioritize it highly.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Frilled Sea Serpent.png"},
{"title":"Gearsmith Prodigy","color":"blue","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"1-drops tend to fall off a lot worse in Limited than Constructed, as your curve isn't so tight that you get to take full advantage. This also looks to be a Constructed card for text-box reasons, and I'd recommend staying away from this unless you somehow pick up 7+ artifacts and are playing a very aggressive deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Gearsmith Prodigy.png"},
{"title":"Ghostform","color":"blue","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"If you can reliably get 5 points of damage out of this and are playing an aggressive deck, I could see playing one copy of this. I'll need to see more of the format before fully forming an opinion on such a niche card, but as-is this doesn't impress me.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Ghostform.png"},
{"title":"Horizon Scholar","color":"blue","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Seeing this next to Cloudreader Sphinx makes me realize how absurd of a common the Cloudreader is because Horizon Scholar was (and is) a sick uncommon bomb. I'd rather have a Cloudreader, but I'm not complaining about the Scholar, and will take and play this almost every time I see it. It's even splashable!","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Horizon Scholar.png"},
{"title":"Metamorphic Alteration","color":"blue","lowScore":"0.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"There are two main reasons this card falls short for me: (1) It doesn’t trigger enters the battlefield effects. Most clone cards do, as you play the creature, copy something with a sweet ETB effect, and profit. This doesn’t because the creature isn’t entering the battlefield. (2) It opens you up to a 2-for-1. It’s all well and good to make something into a 4/4 flyer but if they kill it, you are down a card.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Metamorphic Alteration.png"},
{"title":"Mirror Image","color":"blue","lowScore":"3","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Mirror Image, on the other hand, is fine. It's cheap enough that you'll be able to slot it in when it's convenient, and on average will be better than a random 3-drop. It does need a lot of creatures surrounding it-ideally good ones-but that's a doable quest. I like the name, too-it's very evocative, and captures this effect really well, making it basically the perfect name for this kind of effect.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Mirror Image.png"},
{"title":"Mistcaller","color":"blue","lowScore":"0.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"A swing and a mist. This might be a plausible sideboard card against a deck with multiple cards that this hoses, but that seems like a stretch to me.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Mistcaller.png"},
{"title":"Mystic Archaeologist","color":"blue","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Make no Mystic, this card is awesome. It's barely a 2-drop because you don't really want to risk it in combat, but it can attack or block in a pinch. Mostly it wins you any game where you've stabilized enough to use the ability, as you'll pull far ahead of the opponent once you start digging into your library.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Mystic Archaeologist.png"},
{"title":"Omenspeaker","color":"blue","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I like an early blocker that is relevant at any point in the game, so this speaks my language. It helps you find your third land or avoid drawing your seventh, which is a nice range to have.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Omenspeaker.png"},
{"title":"Omniscience","color":"blue","lowScore":"0","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Instead of casting this, cast whatever else you have many turns earlier.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Omniscience.png"},
{"title":"One with the Machine","color":"blue","lowScore":"0","highScore":"2.5","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Most decks will be none with the machine, but a deck with 5+ artifacts that cost 3 or more might be in the market. It is highly unlikely you'll end up there, so don't take this unless you already have all the artifacts you need.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/One with the Machine.png"},
{"title":"Patient Rebuilding","color":"blue","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Now this is a build-around I can get behind. Patience is key, as it doesn't kill the opponent very quickly, but providing a path to victory and slightly more than one extra card per turn is a powerful combination of abilities. This is perfect for a control deck, and as long as you can defend yourself (which is easier given all the extra cards), you will eventually win the game.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Patient Rebuilding.png"},
{"title":"Psychic Corrosion","color":"blue","lowScore":"1","highScore":"2","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"The mill deck doesn't look very strong in M19, and it doesn't take a psychic to predict that half-milling the opponent is useless. Don't play this unless you have a ton of support, and I'm not sure where that support would come from.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Psychic Corrosion.png"},
{"title":"Sai, Master Thopterist","color":"blue","lowScore":"2","highScore":"3.5","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"The floor on Sai is pretty high, and not just because he knows how to make flying machines. A 1/4 for 3 isn't a blank, and if you get even one Thopter off of this, you've come out ahead. You may not utilize the sacrifice part very often, but I'd play Sai even if I had only a few other artifacts.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sai, Master Thopterist.png"},
{"title":"Salvager of Secrets","color":"blue","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"It's no secret that recurring removal spells is good, and creatures with this effect have always been great. This is no exception, and Salvager at common makes me think that there's a good removal-based control deck lurking in blue that I can't wait to delve into. Can you imagine getting back Divination with this??","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Salvager of Secrets.png"},
{"title":"Scholar of Stars","color":"blue","lowScore":"1.5","highScore":"3","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Don't play this without artifacts, but treat it like an all-star if you have five or more (especially ones that stick around, like Equipment). This is a solid reward for being in an artifact deck, and something you should be able to pick up late if you're interested.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Scholar of Stars.png"},
{"title":"Sift","color":"blue","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"The power of card draw should not be underestimated. There's a huge difference between this costing 4 and a single blue and Weight of Memory costing five and double blue, which is why I am giving this a much higher grade. Sift not only pulls you ahead in the late game, it's cheap enough to still count as draw-smoothing and can salvage your bad draws. This got moved up to uncommon for a reason.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sift.png"},
{"title":"Skilled Animator","color":"blue","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Given that this is a 1/3 base, it's not the end of the world if you don't end up with a ton of targets. When it does hit, you'll run away with the game quickly, and this is a solid payoff for having a couple of cheap artifacts in your deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Skilled Animator.png"},
{"title":"Sleep","color":"blue","lowScore":"2","highScore":"3.5","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I'm giving this a split rating because Sleep is a consistently overvalued card, and I want the rating to reflect how it is not a bomb unless your deck is aggressive. This is a fine early pick and a real beating if your deck wants to attack, which some blue decks certainly will. But it's quite poor in a controlling deck, and plenty of blue decks would rather just have a Sift or Divination instead. Don't assume that this is always a bomb because sometimes it won't be what your deck is looking for.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sleep.png"},
{"title":"Snapping Drake","color":"blue","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"There's nothing wrong with Snapping Drake, and I'm never unhappy including one in my deck. It doesn't block all that well, so some controlling decks will pass, but the vast majority of decks will want this.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Snapping Drake.png"},
{"title":"Supreme Phantom","color":"blue","lowScore":"2.5","highScore":"3","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"A 1/3 flyer for 2 is a fine deal, so it only takes a few other Spirits before this becomes sweet. This isn't a first-pick card I'd build a deck around-it's more of a nice addition to a deck with lots of spirit.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Supreme Phantom.png"},
{"title":"Surge Mare","color":"blue","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I really like Surge Mare. It's a nice combination of being a good blocker, solid attacker, and value-added loot ability. It's not a bomb but it is a workhorse, and any blue deck will want what this offers. It's even got a little extra value against green, which is the color most able to block this early.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Surge Mare.png"},
{"title":"Switcheroo","color":"blue","lowScore":"1.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I was never a huge fan of this. Sometimes you get to trade a 1/1 for a 5/5, but paying a lot of mana to be down a card isn't exactly what I'm in for. It gets better if your deck can make tokens, so if you can do that this is a fine late pickup.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Switcheroo.png"},
{"title":"Tezzeret, Artifice Master","color":"blue","lowScore":"4.5","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Making a Thopter each turn is a nice ability, and Tezzeret starts with enough loyalty that you'll frequently be able to take the first hit and build up a blocking force. He can even draw extra cards if 1/1 flyers won't do the trick, and the ultimate is a real thing if they can't attack his loyalty.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Tezzeret, Artifice Master.png"},
{"title":"Tolarian Scholar","color":"blue","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Where's your Wizard build-around now?? Now that Tolarian Scholar isn't subsidized by Academy Journeymage and company, there's really no reason to run this.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Tolarian Scholar.png"},
{"title":"Totally Lost","color":"blue","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"removal","face":"","fixing":"","review":"Paying 5 mana for this effect isn't exactly where I want to be, but I'm not totally against this. Most decks will want one of these, but multiples is a bit heavy on the curve.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Totally Lost.png"},
{"title":"Uncomfortable Chill","color":"blue","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"Despite -x/-0 effects being mediocre on average, this is priced to move. It's a solid combat trick that can net one or more extra cards, and a fine inclusion in most decks (especially defensive ones).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Uncomfortable Chill.png"},
{"title":"Wall of Mist","color":"blue","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I'm not too interested in spending my turn 2 on this, so I'm likely out unless I have a lot of Divinations.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Wall of Mist.png"},
{"title":"Windreader Sphinx","color":"blue","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Odd stats aside, this is a great 7-drop. It blocks well, and rewards you mightily for attacking. It also draws cards right away in a deck with flyers, making it a pseudo ETB effect, which is nice on such a high investment card.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Windreader Sphinx.png"},
{"title":"Aegis of the Heavens","color":"white","lowScore":"1","highScore":"","set":"m19","rarity":"uncommon","instant":"instant","removal":"","face":"","fixing":"","review":"There's not a huge functional difference between +1/+3 and +1/+7. Either way, your creature is probably going to live and you're not making it hit a whole lot harder. This is a marginal combat trick with some flashy numbers.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Aegis of the Heavens.png"},
{"title":"Aethershield Artificer","color":"white","lowScore":"2","highScore":"3.5","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"By virtue of being a 3/3 for 4, you can't go too wrong with this. I'd play it if I had any artifact creatures at all, and once you get to 3+ it becomes one of the better cards in your deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Aethershield Artificer.png"},
{"title":"Ajani, Adversary of Tyrants","color":"white","lowScore":"4","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Ajani continues the rich tradition of his bloodline by being great when ahead and mediocre when behind. If you are already pressuring the opponent, this will almost assuredly win you the game. If they are ahead on board or have a flyer you can't stop, this buys you some life and distributes some counters. I'd always play this, but would bias toward aggro and cheap creatures to really maximize it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Ajani, Adversary of Tyrants.png"},
{"title":"Ajani's Last Stand","color":"white","lowScore":"2.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"This card is interesting. In a creature-heavy deck, it will be a 4/4 flyer for 4 with a small delay, which is something I'm into. It's especially great if you curve into it, and if you can play this on 4 after deploying a couple of  creatures. On the flip side, it's a really bad topdeck and quite mediocre in creature-light decks, so I wouldn't prioritize it but will be happy when it makes the cut. It's also a beating against discard, making it a sick sideboard card against anyone attacking you in that manner.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Ajani's Last Stand.png"},
{"title":"Ajani's Pridemate","color":"white","lowScore":"3","highScore":"3.5","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"There's enough incidental life gain in the set that I think this is baseline just a good playable. In a deck with recurring life gain, it becomes a reliable big threat, which is a lot for just 2 mana.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Ajani's Pridemate.png"},
{"title":"Ajani's Welcome","color":"white","lowScore":"1","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Ajani's Welcome is anything but that, but in a heavy life gain deck it can be a source of constant triggers for your payoffs. This is a card I predict gets overplayed, and I can already feel it wearing out its welcome from here.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Ajani's Welcome.png"},
{"title":"Angel of the Dawn","color":"white","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"If this core set plays like they usually do, a 3/3 flyer for 5 is already fine, and the mass pump + vigilance is the cherry on top of an already-delicious sundae. Take this, play it, and try to be a curve-out white deck to make it the best it can be (I've said that a lot and we are still on \"A\", so take note).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Angel of the Dawn.png"},
{"title":"Cavalry Drillmaster","color":"white","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"A 2-drop that has utility later in the game is a delight, and there's a reason I always grade these highly-you need some number of early plays in any deck just to be functional, but the cost is that you draw them later. With cards like this, that cost is mitigated, and you aren't sad when you get to drill something on turn 7.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Cavalry Drillmaster.png"},
{"title":"Cleansing Nova","color":"white","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"removal","face":"","fixing":"","review":"I doubt the second clause will come up much, but extra flexibility is nice. A 5-mana Wrath of God in a straightforward format is a card I'm pretty happy about, even if I don't think it's a bomb. It does pair nicely with life gain, as you can stall the opponent and make them over commit, and I would play this in any white deck, as even aggressive ones can fall behind.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Cleansing Nova.png"},
{"title":"Daybreak Chaplain","color":"white","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"The statline on this makes me hesitant to play it outside of a life gain deck, though it makes a pretty nice sideboard card against some aggro decks. It just doesn't hit hard enough, so you really need to care about the lifelink for it to be worth it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Daybreak Chaplain.png"},
{"title":"Dwarven Priest","color":"white","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Not only is this great in a life gain deck, it's not bad in a normal deck either. It comes up a little short in aggro, but most control decks will be happy to run this as a defensive measure. You want to have a decent number of creatures, as gaining 3+ life is where you want this to land.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Dwarven Priest.png"},
{"title":"Gallant Cavalry","color":"white","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This is basically Call the Cavalry, though slightly better because you can bounce this or get it back from the graveyard (Goofus bounces his own token-Gallant bounces the Cavalry for maximum value). This is a good addition to any white deck, and only starts to lose some luster once your 4-drop slot is full.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Gallant Cavalry.png"},
{"title":"Herald of Faith","color":"white","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":" Herald of Faith is a beating. Half-lifelink is still plenty, and a 4/3 flyer is no joke.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Herald of Faith.png"},
{"title":"Hieromancer's Cage","color":"white","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Oblivion Ring for 4 mana is still a highly-desirable Limited card. Handling anything is huge, and this does so easily (also, that Minotaur looks like it's going to lead with \"despite all my rage…\").","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Hieromancer's Cage.png"},
{"title":"Inspired Charge","color":"white","lowScore":"1","highScore":"3","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"When this is good, it's great, but most decks will leave it on the sidelines. Aggressive decks with 17+ creatures want this effect, and basically nobody else does.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Inspired Charge.png"},
{"title":"Invoke the Divine","color":"white","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"removal","face":"","fixing":"","review":"Now that we aren't in Dominaria (or are we? I'm not sure where the core set even lives), maindecking artifact/enchantment kill doesn't seem right. This is a great sideboard card, and likely maindeckable in Sealed, but not where I'd want to be in Draft.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Invoke the Divine.png"},
{"title":"Isolate","color":"white","lowScore":"0","highScore":"","set":"m19","rarity":"rare","instant":"instant","removal":"removal","face":"","fixing":"","review":"In some extremely isolated circumstances, your opponent has 4+ cards that cost 1 mana, and maybe this is a sideboard card. Given that this is a rare, that seems highly unlikely to ever line up.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Isolate.png"},
{"title":"Knight of the Tusk","color":"white","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I asked one of the most successful Team Limited competitors of our time (Andrew Baeckstrom) about this card, and all he said was, \"thicc.\" I guess that just about sums it up. If you need something expensive, here you are, and it's even a Knight to boot.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Knight of the Tusk.png"},
{"title":"Knight's Pledge","color":"white","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I really hope this ends up being bad. If Auras have gotten so playable that a vanilla +2/+2 gets there, we are not living in a world I'm happy about. The inherent risk of card disadvantage when you put this on a creature is not worth the upside, and I'm going to operate under the assumption that this format has enough removal that this won't cut it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Knight's Pledge.png"},
{"title":"Knightly Valor","color":"white","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"This, on the other hand, does work out quite nicely. There's nothing like getting a free token to make up for that risk, and Knightly Valor also gives vigilance alongside that. It's a little weird seeing this and a 2/2 that makes a Knight, but Knights are a theme of the set.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Knightly Valor.png"},
{"title":"Lena, Selfless Champion","color":"white","lowScore":"4.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"A 6-drop that more than doubles your team is a large threat, and she even can sacrifice herself to protect your team in the event of a disaster. Lena really rewards going hard on assembling an army, and is far from the last card to push that strategy. It is funny that the Selfless Spirit protects your board better than the Selfless Champion-who's the real MVP there?","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Lena, Selfless Champion.png"},
{"title":"Leonin Vanguard","color":"white","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I like this less as an attacker and more as a recurring source of life gain. It can sit there and gain 1 a turn once it has some friends, and there are plenty of cards that pay you off when it does that.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Leonin Vanguard.png"},
{"title":"Leonin Warleader","color":"white","lowScore":"4.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"White has some nice token makers this time around. Leonin Warleader is a 4/4 for 4 that comes with some nice backup when it attacks, and plays perfectly with combat tricks and mass pump spells while also enabling life gain payoffs. This is one of the few cats I'd actually like, since everyone knows that dogs are vastly superior.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Leonin Warleader.png"},
{"title":"Loxodon Line Breaker","color":"white","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Do you need stats? If yes, sign on the dotted line.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Loxodon Line Breaker.png"},
{"title":"Luminous Bonds","color":"white","lowScore":"3.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"removal","face":"","fixing":"","review":"At no point will this common slot not be the best, and Luminous Bonds is firmly where it was the last time we saw it (in the lead).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Luminous Bonds.png"},
{"title":"Make a Stand","color":"white","lowScore":"1","highScore":"3","set":"m19","rarity":"uncommon","instant":"instant","removal":"","face":"","fixing":"","review":"This is effectively Inspired Charge, but it trades a point of power for infinite toughness. That's not as good a deal as it sounds, given the goal of these cards, but either one of these will usually do the trick.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Make a Stand.png"},
{"title":"Mentor of the Meek","color":"white","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"It's very hard to lose if this survives, and the cost is low enough that you aren't taking a huge risk when you play it. It should change your Draft order to maximize its value, but most white decks will be happy picking this up, even in pack 3. Note that it works quite well with token-making cards, as you don't need to cast the creatures.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Mentor of the Meek.png"},
{"title":"Mighty Leap","color":"white","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"I think I called this medium leap last time I saw it, but even if I did, I'm running it back.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Mighty Leap.png"},
{"title":"Militia Bugler","color":"white","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Much like Augur of Bolas, this will give you a lot of information about the bottom of your library. It seems easy enough to get 8+ targets into your deck, as power 2 or less is simpler than cost 2 or less, and at that point this is a fine deal.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Militia Bugler.png"},
{"title":"Novice Knight","color":"white","lowScore":"2.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I like this in control decks even if it never attacks, and beatdown decks once you have 4+ Auras or Equipment that you were planning on playing anyway. Don't use this to justify playing bad Auras, but do use good Auras/Equipment as a justification for playing this.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Novice Knight.png"},
{"title":"Oreskos Swiftclaw","color":"white","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"When you want to beat down, you won't be turning down 3 power for 2 mana.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Oreskos Swiftclaw.png"},
{"title":"Pegasus Courser","color":"white","lowScore":"3.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This overperformed in Dominaria, and this looks to be a lower-powered format, which makes the Courser even better. It will often be the best thing going on, and that's high praise for a card that only costs 3 mana.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Pegasus Courser.png"},
{"title":"Remorseful Cleric","color":"white","lowScore":"3","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"I wonder if this is remorseful about how much better it is in Constructed than Limited. Even if you discount the sacrifice ability, this is still a 2/1 flyer for 2, which is a fine deal.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Remorseful Cleric.png"},
{"title":"Resplendent Angel","color":"white","lowScore":"5","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"A big part of power level is opportunity cost-what am I giving up or risking when I play this card? When the card in question is a 3/3 flyer for 3, the answer is \"nothing,\" and that's what pushes this from a 4.5 to 5.0. This card is absurd, and you should slam it every time you see it in pack 1. In pack 2, strongly consider switching, and in pack 3, start counting how many cards you'll be short if you switch to white.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Resplendent Angel.png"},
{"title":"Revitalize","color":"white","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"If you end up in the life-gain-matters synergy deck, this is a fine addition. If you don't, only play this if you're very short cards.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Revitalize.png"},
{"title":"Rustwing Falcon","color":"white","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Honestly, this card is probably a 1.5-if you have a few ways to pump it, and are an aggressive deck, you could do worse. I'm not getting on my soapbox here because there is a difference between a 1/1 and a 1/2, and I suspect that I'll end up playing this card.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Rustwing Falcon.png"},
{"title":"Shield Mare","color":"white","lowScore":"2.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"If you're the life gain deck, bump this up a notch, and also factor in that it's got some extra value against red. If the format ends up being very fast, this also could be great, as it does gain you a lot of life if the opponent has to spend a spell on it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Shield Mare.png"},
{"title":"Star-Crowned Stag","color":"white","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"In an aggressive deck, this may edge toward a 3.5, as it's very hard to block. Between this and Pegasus Courser, white beatdown has some all-stars.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Star-Crowned Stag.png"},
{"title":"Suncleanser","color":"white","lowScore":"1.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"This is a clean and elegant answer to the now-banned energy deck in Standard, or something. In Limited, this will play as a 1/4 for 2, and every now and then will knock some counters off an Ajani's Pridemate.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Suncleanser.png"},
{"title":"Take Vengeance","color":"white","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"removal","face":"","fixing":"","review":"Aggressive decks aren't very interested in vengeance, as they are more proactive than that. Control decks will play this, though having to get hit by something before killing it is a real drawback. This gets worse in multiples as a result, though the combo of this and Star-Crowned Stag is real, and may make this sick in aggro decks that have two Stags.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Take Vengeance.png"},
{"title":"Trusty Packbeast","color":"white","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Somehow the Packbeast carries more than an Excavation Elephant, judging by how often the ability works. This is a good card in artifact-themed decks, and is filler everywhere else.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Trusty Packbeast.png"},
{"title":"Valiant Knight","color":"white","lowScore":"3.5","highScore":"4","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"By itself, this is a substantial threat. Once you add in 3+ other Knights, it becomes extremely powerful, and worth building around. +1/+1 and double strike is a lot of damage, and remember that the double strike ability applies to Valiant Knight as well.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Valiant Knight.png"},
{"title":"Abnormal Endurance","color":"black","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"We never knew how good we had it with Supernatural Stamina, at least not until it was gone. Abnormal Endurance is an acceptable combat trick if you're in the market for one, which not every deck will be. It does get bonus points if you have a bunch of creatures with ETB effects, so be on the lookout for that.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Abnormal Endurance.png"},
{"title":"Blood Divination","color":"black","lowScore":"1","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Without support, this is quite bad. Divination isn't Divination if you have to sacrifice a creature, even with an extra card attached. Once you're in the sacrifice deck (usually red-black, but potentially white-black or blue-black with enough tokens), this becomes a lot more interesting. It's still on the low end of payoffs, so don't prioritize it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Blood Divination.png"},
{"title":"Bogstomper","color":"black","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I'd much rather be stomping terra than bog, but sometimes you have to play with the cards you're dealt. These won't be in high demand, and are a fine way to fill your top-end slots if you've got nothing else.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Bogstomper.png"},
{"title":"Bone Dragon","color":"black","lowScore":"4.5","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Someone is getting boned, that's for sure. This thing is huge, flies, and can even come back later in the game. Granted, seven cards is a lot, but it's pure upside, and you will eventually get there if the game drags on.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Bone Dragon.png"},
{"title":"Child of Night","color":"black","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"In the life gain deck, this is a premier 2-drop, and it's more than fine outside of it as well. Extra life matters, and getting 2-4 points from this puts it ahead of most things you could cast on turn 2.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Child of Night.png"},
{"title":"Death Baron","color":"black","lowScore":"2.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"With four common Zombies and a common Skeleton (plus more at higher rarities), Death Baron isn't bad card to gamble on. It won't be a deck-defining card very often, but it will be worth playing, as it pays you off with as few as three other creatures it pumps. If deathtouch lets you trade up even once, this is a fine deal.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Death Baron.png"},
{"title":"Demon of Catastrophes","color":"black","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"This has some build-around elements to it, as you don't want to just jam it in a 10-creature deck without sacrifice fodder, but the payoff here is big enough that it's worth taking early and trying to enable. It's not a catastrophe if you end up playing it in a deck with only one or two good outlets, as long as you have cheap creatures to eat. Note that if your opponent has too many ways to remove this, consider siding it out.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Demon of Catastrophes.png"},
{"title":"Diregraf Ghoul","color":"black","lowScore":"2.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Between the minor Zombie theme and this just being a 1 mana 2/2, most decks will run this. It's not an exciting early pick, but it'll get the job done.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Diregraf Ghoul.png"},
{"title":"Doomed Dissenter","color":"black","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I've generally been happy with this card, even without synergies, and once you add in the sacrifice theme this becomes quite appealing. Some black-red decks will slam this without hesitation, and it's a fine blocker in blue-black control, making it fairly well-rounded.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Doomed Dissenter.png"},
{"title":"Duress","color":"black","lowScore":"0.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I've never run into a format where maindecking Duress is right, and I doubt M19 will change that. It is a great sideboard card, so keep an eye on how spell-dense the opponent is.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Duress.png"},
{"title":"Epicure of Blood","color":"black","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"face","fixing":"","review":"This isn't exactly a big payoff for life gain, as it will ping the opponent for 1-2 damage a turn at best. Still, it's large enough to stall the ground, and does eventually kill them, so it might cure your ills if you're looking for a finisher.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Epicure of Blood.png"},
{"title":"Fell Specter","color":"black","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"face","fixing":"","review":"Getting one of their cards, pinging them for 2, and leaving a 1/3 flyer on the board is a lot of action for 4 mana, even if you never trigger the second ability again. Fell Specter is not a build-around, just a solid playable that you aren't likely to cut.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Fell Specter.png"},
{"title":"Fraying Omnipotence","color":"black","lowScore":"0","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"face","fixing":"","review":"It's really hard to imagine getting a substantial advantage out of this. The way to \"abuse\" it is to cast it when the rounding up clause hurts the opponent, as it makes them sacrifice two creatures if they have three, and the like. Still, paying 5 mana for a symmetrical effect is something I'm very suspicious of, and this is a card I'll have to tinker with before I'm convinced.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Fraying Omnipotence.png"},
{"title":"Gravedigger","color":"black","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I need no convincing on Gravedigger-it's an easy 2-for-1 that buys back a good card and pairs nicely with bounce and sacrifice cards alike. It's even splashable for good measure.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Gravedigger.png"},
{"title":"Graveyard Marshal","color":"black","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"This combines an aggressive stat line with a good late game ability, which is a desirable mix. You don't have to do anything special besides play creatures to make this great, and every deck will want it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Graveyard Marshal.png"},
{"title":"Hired Blade","color":"black","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"Hired Blade will ambush most things that cross his path, but at a price. He's not walking away from most of those encounters, which doesn't make for a lot of repeat customers. This is a decent creature with an ability that will let it trade up or get free damage in, which makes it a passable addition to most decks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Hired Blade.png"},
{"title":"Infectious Horror","color":"black","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I wouldn't go so far as to call this horrorable, but that's only because I've run that one so many times. I will say that playing it isn't sick and more sickly than anything else. This is just too small to make an impact, and definitely not for 4 mana.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Infectious Horror.png"},
{"title":"Infernal Reckoning","color":"black","lowScore":"0","highScore":"","set":"m19","rarity":"rare","instant":"instant","removal":"removal","face":"","fixing":"","review":"I'd stick to killing Eldrazi and Inkmoth Nexus in Modern, or whatever Constructed applications this may end up having.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Infernal Reckoning.png"},
{"title":"Infernal Scarring","color":"black","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"The payoff here is not worth the risk or the effort, as you're jumping through a lot of hoops to maybe have this replace itself.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Infernal Scarring.png"},
{"title":"Isareth the Awakener","color":"black","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"A 3/3 deathtouch for 3 that puts you up a card each time it attacks is something I'm definitely in for. At the very least, Isareth is a 2-for-1, and often will be much better.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Isareth the Awakener.png"},
{"title":"Lich's Caress","color":"black","lowScore":"3.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"removal","face":"","fixing":"","review":"The extra 3 life matters a lot here. Not only does it enable life gain synergies, it keeps you alive after you spend 5 mana killing a creature. Unconditional removal with an upside gets a 3.5 in my book, even if just barely.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Lich's Caress.png"},
{"title":"Liliana, Untouched by Death","color":"black","lowScore":"1","highScore":"2.5","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"I was all ready to give Liliana a high grade, but then I read her. If your deck isn't full of Zombies, she does nothing. None of her abilities work without Zombies, and that's not something you can rely on in this format. If you end up with 5+ Zombies in your deck, she will be solid, but this isn't a planeswalker you should rejoice about opening.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Liliana, Untouched by Death.png"},
{"title":"Liliana's Contract","color":"black","lowScore":"2.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"The power of this is mostly based on the second clause, as you can pick up 5-6 Demons in an average Draft. By that, I mean that you should treat this as a painful way to draw cards, and try and use it in an aggressive deck or one that has a lot of life gain. It's quite powerful if you can afford it, which is on-theme for a Contract from Below.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Liliana's Contract.png"},
{"title":"Macabre Waltz","color":"black","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"If you've got a lot of creatures, this is a fine way to turn a land into two spells in the late game. I value the first one of these pretty highly, and then they get subsequently less valuable.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Macabre Waltz.png"},
{"title":"Mind Rot","color":"black","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I never feel too bad about putting this in my deck, and sometimes it really overperforms. It's also great in Sealed, and a reason to keep excess lands in your hand if you don't need to play them.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Mind Rot.png"},
{"title":"Murder","color":"black","lowScore":"4","highScore":"","set":"m19","rarity":"uncommon","instant":"instant","removal":"removal","face":"","fixing":"","review":"Killing anything for 3 mana is what we in the card reviewing business call a good deal.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Murder.png"},
{"title":"Nightmare's Thirst","color":"black","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"instant","removal":"removal","face":"","fixing":"","review":"Worst case, this is a deal 1 gain 1, which is a decent sideboard option against X/1s. In a deck built to maximize this, it can kill real creatures for just 1 mana, which can be a nightmare to play against. Once you have 3+ sources of life gain, this becomes a good addition to your deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Nightmare's Thirst.png"},
{"title":"Open the Graves","color":"black","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"It looks very difficult to win a long game against an opponent who opens this, and as long as they have enough creatures in their deck, you will have trouble running them out of cards.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Open the Graves.png"},
{"title":"Phylactery Lich","color":"black","lowScore":"1","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"You need a lot of artifacts and a lot of Swamps for this to make the cut, so I prefer to bask in the sweet Lich flavor and not worry too much about how playable it is.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Phylactery Lich.png"},
{"title":"Plague Mare","color":"black","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Horsey Chainwhirler is a great post-combat play after your opponent blocks your 2/2s with 3/3s, and can clean up 1 toughness creatures like nobody's business. Plus, every now and then it'll sneak past some white creatures.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Plague Mare.png"},
{"title":"Ravenous Harpy","color":"black","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"In the dedicated sacrifice deck, this is a great finisher. Outside of that, its appetite is not worth satiating, as what you pay is not worth what you get. This starts a little small and takes a lot of food before it becomes great.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Ravenous Harpy.png"},
{"title":"Reassembling Skeleton","color":"black","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"It's not a disaster if you have to play this without synergies, as it blocks ground creatures and can be discarded or milled for profit. When you do have combos, it's awesome, and overall is a card I don't mind taking early.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Reassembling Skeleton.png"},
{"title":"Rise from the Grave","color":"black","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"This is one way to make a Zombie, I suppose. I never prioritize this, but it can be a decent 5-drop in a deck with great creatures or great removal (ideally both).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Rise from the Grave.png"},
{"title":"Skeleton Archer","color":"black","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"removal","face":"face","fixing":"","review":"Much like in most videogames, Skeleton Archer isn't the weakest minion but it isn't the best either. It's annoying to face and definitely has its high points, while also being quite killable. I like this card, and would run as many as I could get.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Skeleton Archer.png"},
{"title":"Skymarch Bloodletter","color":"black","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"face","fixing":"","review":"Skymarch Bloodletter loses a little ground from Ixalan, given that Vampires are no longer a supported tribe and the format is a little slower, but it's still a solid playable that will make your deck every time. Plus, the life gain deck is a thing, so it's not all bad news.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Skymarch Bloodletter.png"},
{"title":"Sovereign's Bite","color":"black","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"face","fixing":"","review":"I'd have to have a lot of life gain synergies before I took a bite of this apple, and I suspect it won't happen very often (if at all).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sovereign's Bite.png"},
{"title":"Stitcher's Supplier","color":"black","lowScore":"1","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"If the creature type Zombie matters a ton and you have graveyard synergies, stock up. Otherwise, this should be avoided at all costs.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Stitcher's Supplier.png"},
{"title":"Strangling Spores","color":"black","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"removal","face":"","fixing":"","review":"You can snap off 3 toughness creatures or use this in combat to kill larger things, both of which are desirable effects for 4 mana. This is good, clean removal, which is always something you're choked on in Limited.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Strangling Spores.png"},
{"title":"Two-Headed Zombie","color":"black","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Do they eat double the brains of a normal Zombie or just each get half as much? Either way, this is a good aggressive card and a playable Zombie, both of which you may be interested in.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Two-Headed Zombie.png"},
{"title":"Vampire Neonate","color":"black","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This looks like a card people are going to want to play, but I'm not giving up that easily-unless your opponent has a lot of 2 power creatures and you have life gain synergies, this shouldn't be in your deck. It just doesn't do enough to justify the card slot.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Vampire Neonate.png"},
{"title":"Vampire Sovereign","color":"black","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"face","fixing":"","review":"A 3/4 flyer that drains for 3, on the other hand, is something I'm definitely in for. This is an evasive threat with a strong ETB ability, which is a recipe for success in Limited.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Vampire Sovereign.png"},
{"title":"Walking Corpse","color":"black","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This mostly gets there on curve considerations, but it may also get there on creature type from time to time. Either way, don't be worried if this makes the cut.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Walking Corpse.png"},
{"title":"Act of Treason","color":"red","lowScore":"1","highScore":"3","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This is one of the more interesting cards in the set. By itself, it's not great. It's a narrow card for hyper-aggressive decks, but generally wrong to run. It doesn't do much unless you're really pressuring their life total, and isn't worth a card in most circumstances. Where it gets good is when you're in the sacrifice deck, usually red-black, and have 3+ ways to sacrifice whatever you steal. Once you have that, this becomes extremely threatening, as it's Terminate plus deal damage to your opponent, and you even get the benefit of any death triggers their creature may have. I wouldn't take this early, but it's the most important payoff in the sacrifice deck, so once you're deep into that this becomes a very high pick.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Act of Treason.png"},
{"title":"Alpine Moon","color":"red","lowScore":"0","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"This is wildly unplayable in formats where Urza's Tower doesn't exist.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Alpine Moon.png"},
{"title":"Apex of Power","color":"red","lowScore":"0","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Getting to 10 mana isn't realistic, even if this effect is insanely powerful.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Apex of Power.png"},
{"title":"Banefire","color":"red","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"removal","face":"face","fixing":"","review":"Banefire acts as a decent removal spell or a great finisher, and that flexibility is worth a lot. It's even easily splashable, and in a format with Salvager of Secrets, is a card I'm taking very highly.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Banefire.png"},
{"title":"Boggart Brute","color":"red","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Menace makes this trade up well and get past 2/1s easily, while also making any combat trick you may have particularly brutal. I'd always run this in aggressive decks, and it's fine even in midrange ones.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Boggart Brute.png"},
{"title":"Catalyst Elemental","color":"red","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I'm not really looking to spend a card ramping out a 6-drop early, and a 2/2 for 3 is unimpressive otherwise. You'd have to be really desperate to run this, and it'll rarely be rite to do so.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Catalyst Elemental.png"},
{"title":"Crash Through","color":"red","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"There's a very light spells-matter theme in the set, so feel free to run this if you get extra benefit from it. Otherwise, it's not worth a slot in your deck, as trample is such a minor upside.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Crash Through.png"},
{"title":"Dark-Dweller Oracle","color":"red","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"I'm a fan of this. It is a 2/2 for 2 that has a lot of utility in the late-game, and can even replace itself if need be. Remember to always use this before playing a land, and if it's open, the sacrifice deck is the best place for this by far.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Dark-Dweller Oracle.png"},
{"title":"Demanding Dragon","color":"red","lowScore":"4.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"face","fixing":"","review":"It's hard to demand much more than this, as it's a 5/5 for 5 with solid upside. That's a bomb under any definition, and a card I'd be overjoyed to open.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Demanding Dragon.png"},
{"title":"Dismissive Pyromancer","color":"red","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"removal","face":"","fixing":"","review":"Like Dark-Dweller Oracle, this is good at any point in the game, and even lets you see extra cards in a similar fashion. Once you've rummaged to your heart's content, you can dismiss the Pyromancer in exchange for one of their creatures, making this a great card in any deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Dismissive Pyromancer.png"},
{"title":"Doublecast","color":"red","lowScore":"1","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Despite getting to Twincast Mind Sculpt and Divination in one of my favorite Draft videos (which has been lost to the sands of time), I'm not all that excited for Doublecast. It requires you to have a lot of good, cheap spells, and the upside isn't as big as the risk of it being stuck in hand. If you do have 9+ other spells and at least 4 of them are cheap removal, this is likely worth it, but that isn't the typical use case.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Doublecast.png"},
{"title":"Dragon Egg","color":"red","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"This is a goose egg in an aggressive deck, playable but mediocre in a defensive one, and an all-star in the sacrifice-themed deck. Eating this for value gives you a very good flyer and whatever you got from sacrificing it, which is a great deal for 3 mana. One of the main strengths of the sacrifice deck is that you get a lot of value from cards other people don't want, and Dragon Egg is a great example of that.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Dragon Egg.png"},
{"title":"Electrify","color":"red","lowScore":"3.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"removal","face":"","fixing":"","review":"Shockingly, this is a piece of great removal. It kills almost anything you want, at instant speed, and doesn't cost a ton. There are a million different burn spells in this set, and most of them are good-this is one of them.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Electrify.png"},
{"title":"Fiery Finish","color":"red","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"removal","face":"","fixing":"","review":"Realistically, you aren't cutting this most of the time, but it's not a card I'm excited about. Paying 6 mana at sorcery speed is fine-you do need a way to finish off big creatures.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Fiery Finish.png"},
{"title":"Fire Elemental","color":"red","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I suspect that you'll play this a little more often than you did in Dominaria. It's not great, but it sure has some stats.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Fire Elemental.png"},
{"title":"Goblin Instigator","color":"red","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This plays nicely with token and sacrifice themes, while also providing a fine pair of blockers for a more controlling deck. Cards like this punish 1 toughness attackers really well, so keep that in mind when looking at 2/1 ground creatures for your aggro deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Goblin Instigator.png"},
{"title":"Goblin Motivator","color":"red","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Bloodlust Inciter ended up being a solid 2.0 in Amonkhet, but that was largely due to the speed of the format. I still don't like this in most formats/decks, and I'm not feeling very motivated to play it here. You'd need a really aggressive deck that also had use for 1/1s, so perhaps an aggro sacrifice deck might want this. Either way, you will be able to get this late.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Goblin Motivator.png"},
{"title":"Goblin Trashmaster","color":"red","lowScore":"2","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"With two good common Goblins (and a less motivational one), plus a couple of uncommons, the Trashmaster is a solid pick. I wouldn't slam it early, but it isn't trash either-most red decks won't mind running this. Plus, every now and then you'll snipe an artifact with the second ability.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Goblin Trashmaster.png"},
{"title":"Guttersnipe","color":"red","lowScore":"1","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Once you've got 9+ spells in your deck, Guttersnipe is a legit threat. It's not an early pick, but I bet blue-red spells decks wouldn't mind using this as a decent finisher.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Guttersnipe.png"},
{"title":"Havoc Devils","color":"red","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"These have good stats and a relevant keyword. For red, that's pretty good, as red creatures tend to be pretty medium. Even with the RR casting cost, I don't think red decks will be in the business of cutting Havoc Devils (unless they are the defensive spell-based version).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Havoc Devils.png"},
{"title":"Hostile Minotaur","color":"red","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I wouldn't call this amazing, but it's better than average in beatdown decks. Curving into Hostile Minotaur pressures the opponent a lot, and it's able to close games out reasonable well. Between this and Havoc Devils, red has some good options at 4, which funnily enough makes either of these less of a priority to pick up.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Hostile Minotaur.png"},
{"title":"Inferno Hellion","color":"red","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"At the very least, Inferno Hellion hits hard. If you want to attack the opponent, this is decent 4-drop, and it combines nicely with bounce spells. Your opponent will often just take the hit, after which you bounce and replay it. In a pinch, this can block, but I'm not all that excited about doing that.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Inferno Hellion.png"},
{"title":"Lathliss, Dragon Queen","color":"red","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Lathliss is essentially a 5/5 flyer for 6 with minor upside, but Dragons are Dragons, and this can close out games nicely. I'm not in the business of passing up on huge flying finishers, even if you aren't getting max value from all her tribal synergies (though, with Sparktongue Dragon at common, it's not impossible to imagine).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Lathliss, Dragon Queen.png"},
{"title":"Lava Axe","color":"red","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"face","fixing":"","review":"I don't think most red decks will want this as a way to end games. Creatures are great, and red isn't lacking for quality options at the top of the curve. I suppose a hyper aggro deck might want two of these as the only 5-drops, but that isn't where I'd start.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Lava Axe.png"},
{"title":"Lightning Mare","color":"red","lowScore":"2.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"This can breath enough lightning to take down bigger creatures or punch for extra damage, making it a good option for heavy red aggressive decks. It even will randomly run past blue creatures, which will be solid upside in some matchups.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Lightning Mare.png"},
{"title":"Lightning Strike","color":"red","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"instant","removal":"removal","face":"","fixing":"","review":"This is, and has always been, an excellent deal. It doesn't quite crack 4.0, and is better than Electrify, so it probably deserves a 3.5. Lightning Strike efficiently kills most creatures, and can even dome the opponent if the game gets to that point.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Lightning Strike.png"},
{"title":"Onakke Ogre","color":"red","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":" The main problem with 4/2s is that they tend to trade down for 2-drops, so if you end up playing this, make sure that it's backed up by removal. It does hit hard, so it's playable if you need more bodies. Also, poor Gray Ogre-its Onakke cousins put it to shame at family reunions.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Onakke Ogre.png"},
{"title":"Sarkhan, Fireblood","color":"red","lowScore":"1","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"This trend of super-narrow planeswalkers is an interesting one. Opening Sarkhan isn't going to very exciting, unlike most planeswalkers across Magic's history, as you just won't have the Dragons you need to make this playable. Sarkhan acts like a bad looter, and that's not something I'm interested in.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sarkhan, Fireblood.png"},
{"title":"Sarkhan's Unsealing","color":"red","lowScore":"1","highScore":"3","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"You need a lot of high-power creatures for this to be playable, and the main risk is that you end up with a deck with too high a curve. Onnake Ogre is your best friend in that case, and the reward from Sarkhan's Unsealing is high enough to easily justify it. I like this as an early draft-around, and think it'll lead to some sweet (and good) decks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sarkhan's Unsealing.png"},
{"title":"Shock","color":"red","lowScore":"3.5","highScore":"","set":"m19","rarity":"shock","instant":"instant","removal":"removal","face":"face","fixing":"","review":"Efficient removal never gets old, and you want a mix of these and Electrifies in most decks. There are some decks where this isn't the best, but every deck will have plenty of targets, and spending 1 mana to kill a 2- or 3-drop is very powerful.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Shock.png"},
{"title":"Siegebreaker Giant","color":"red","lowScore":"3","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Cowards can't block giants, or much of anything, when this is in play. Siegebreaker Giant is an excellent drop for the top of your curve, and exactly what red decks want to sink their mana into. It also rewards combat tricks very nicely, as the opponent will be priced into blocking whenever they can, so draft with that in mind. I could see moving this up to a 3.5 if red decks want the finisher that badly.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Siegebreaker Giant.png"},
{"title":"Smelt","color":"red","lowScore":"0.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"removal","face":"","fixing":"","review":"If you're dealt this last pick, make sure not to accidentally play it. It's not even a great sideboard card since there aren't that many artifacts, and some of them are Thopters.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Smelt.png"},
{"title":"Sparktongue Dragon","color":"red","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"removal","face":"","fixing":"","review":"Now this is an exciting common. It'll mostly be a 3/3 flyer for 5, but red never gets that at common, and having a powerful mana sink at 8 is pretty sweet. This is a real payoff for ramping, and it single-wingedly makes red an appealing color to pair with ramp cards. I'm excited about what this might mean for the format, as it's a very impactful common to see show up.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sparktongue Dragon.png"},
{"title":"Spit Flame","color":"red","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"instant","removal":"removal","face":"","fixing":"","review":"It's not often that you'll buy this back, but Sparktongue Dragon helps, and at worst this is still a very good spell.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Spit Flame.png"},
{"title":"Sure Strike","color":"red","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"Havoc Devils makes this a little better than it was before, and in any case it's a solid combat trick. You usually don't need to go after those aggressively, but also shouldn't feel bad if a couple end up in your deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sure Strike.png"},
{"title":"Tectonic Rift","color":"red","lowScore":"1","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Don't let the land destruction element fool you. This is a finisher, and you are rarely going to want to snap this off as a land destruction spell on turn 4. I'd rather just have Lava Axe or Act of Treason, but if you miss on all of those, this can close out games. It's also a fine sideboard card against board stalls or Gift of Paradise, even if it isn't earth-shaking.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Tectonic Rift.png"},
{"title":"Thud","color":"red","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"removal","face":"","fixing":"","review":"At a base level, this isn't very good. 2-for-1'ing yourself to kill a creature isn't a good deal, and finishing the opponent with this is largely ambitious. Where it gets really good is when you have multiple copies of Act of Treason, at which point you've got a two card combo that makes an impact. It's still a 2-for-2, but they spent more mana on their side, and you turned late picks into premiere removal spells. This does combo kill with Inferno Hellion, so keep that in mind.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Thud.png"},
{"title":"Tormenting Voice","color":"red","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I never feel bad about playing Tormenting Voice, but it's never loudly awesome either. It gets a little better in the U/R Spells deck, but past that is about as replaceable as it gets. Spending 2 mana to move cardboard around isn't good in aggro, and isn't really a payoff for control.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Tormenting Voice.png"},
{"title":"Trumpet Blast","color":"red","lowScore":"1","highScore":"2","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"Normal decks definitely don't want this, and it isn't insane unless you're on the mono-tokens plan. If you want this, you'll get it-having a Blast is easy to do in this format.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Trumpet Blast.png"},
{"title":"Viashino Pyromancer","color":"red","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"face","fixing":"","review":"As far as 2/1s for 2 go, this is about the middle of the pack. Yes, it technically has an effect later in the game, but 2 damage isn't lighting the world on fire. I also don't like how many tokens and Doomed Dissenters there are running around, so I'm skeptical that 2/1s are where you want to be.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Viashino Pyromancer.png"},
{"title":"Volcanic Dragon","color":"red","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Volcanic Dragon punches hard and fast, making it a desirable finisher for aggro or control alike. I'm happy taking this early, even if it's a touch below most of the burn spells (due to how I prioritize expensive cards, my reputation notwithstanding).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Volcanic Dragon.png"},
{"title":"Volley Veteran","color":"red","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"removal","face":"","fixing":"","review":"The floor on this is pretty high-it always pings for 1 (barring the opponent removing it in response to the trigger). That makes it playable even as the lone Goblin, and it isn't hard to pick up a couple more and threaten to deal 2-3 damage. That is an awesome card, and Volley Veteran is a real reason to draft Goblins.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Volley Veteran.png"},
{"title":"Blanchwood Armor","color":"green","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Blanchwood Armor is a funny card-if it's great, your deck probably isn't, because mono-green is unlikely to be a very supported archetype. You really need this to give +3/+3 or greater in order for it to be playable, and +5/+5 or more before it starts feeling unfair. That makes it medium in most decks, though when it's good, it will be very good.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Blanchwood Armor.png"},
{"title":"Bristling Boar","color":"green","lowScore":"2.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I like reverse menace-it makes it hard for your opponents to take down your creatures and lets you attack without fear into boards of small creatures. Green is flush with solid bodies, so this isn't a card you need to prioritize, but it's a little better than a boaring vanilla.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Bristling Boar.png"},
{"title":"Centaur Courser","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"In normal Limited formats, 3/3s for 3 are always a welcome sight. Harrier Naga ended up being mediocre, thanks to how powerful and slow Hour of Devastation was, but I suspect that a core set won't be quite that extreme. If the format ends up being very slow, this could drop to a 2.0, but I'd much rather start it at 3.0 and adjust from there.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Centaur Courser.png"},
{"title":"Colossal Dreadmaw","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This is slightly worse than Carnage Tyrant, mainly because of the lesser stats and lack of great abilities. It's still a perfectly acceptable finisher, and a card I'll play multiples of in a ramp deck. It doesn't even sound bad to play one in a red-green beatdown deck, as a 6/6 trample is no laughing matter for the opponent.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Colossal Dreadmaw.png"},
{"title":"Colossal Majesty","color":"green","lowScore":"1.5","highScore":"2.5","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Colossal Majesty strikes me as a bit win-more, but I'd still run it with six or seven creatures that fit the bill. Like with Sarkhan's Unsealing, Onakke Ogre will be your friend, and there are a couple of other midrange creatures that are colossal enough to trigger this.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Colossal Majesty.png"},
{"title":"Daggerback Basilisk","color":"green","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"The basilisk doesn't hit for enough damage to be an offensive threat, and is small enough that it doesn't stonewall opposing creatures either. It can trade up against decks with big creatures, but looking at a board of 2/2s when you have this can be a dagger. I like having access to this, as it will be very potent out of the sideboard, but don't take this early.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Daggerback Basilisk.png"},
{"title":"Declare Dominance","color":"green","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I think this card will end up being surprisingly dominant. You can use it as a removal spell, and pretty easily pick up a 2-for-1 in the midgame-your 3/3 eats their 2/2 plus their 3/3. Unlike previous versions of this spell, everything has to block, not just something, so you can really wipe out their forces. Later in the game, this lets everything else get through unimpeded, letting you overrun them with attackers. This card will miss some of the time, and is weak to instant-speed removal, but the upside is high enough that it will be an early pick.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Declare Dominance.png"},
{"title":"Druid of Horns","color":"green","lowScore":"1","highScore":"2","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Unplayable without Auras and unexciting with, this isn't a card I'm looking to put in my deck. I don't want to build around it, and don't like the path it leads you down. I guess the joke is that Talons of Wildwood is a low-risk way of making beasts, but I don't really want to play Talons.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Druid of Horns.png"},
{"title":"Druid of the Cowl","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Mana Elves are good, and one that can block when you don't need it for mana is pretty sweet. There's not much to say about this-it's a great card for any green deck, and a reason to go into green.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Druid of the Cowl.png"},
{"title":"Dryad Greenseeker","color":"green","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I'm in love with this card. It's great at any point in the game, and it helps smooth out your draws while ensuring that you don't get flooded in the late game. You only draw lands when you have two in a row, easily letting you overpower your opponent if the game goes long (while blocking and finding you lands in the early game). This card is all about the green, and so am I.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Dryad Greenseeker.png"},
{"title":"Elvish Clancaller","color":"green","lowScore":"1","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"With three Elves at common, none of which are great attackers, this isn't really a card for Limited. It is an exciting addition to Constructed, so be on the lookout for Clancallers to unite in Modern.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Elvish Clancaller.png"},
{"title":"Elvish Rejuvenator","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"This is great. Not only does it ramp you, it does some color-fixing, and leaves you up a card. Even if you can't make specific use of the 1/1 (with sacrifice effects or the like), this can still chump block or make double-blocks better. I'm in for any and all of these that I can get.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Elvish Rejuvenator.png"},
{"title":"Ghastbark Twins","color":"green","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Seven is much more than six, specifically when talking about which turn you hit 7 mana versus 6 mana. That said, this does block really well and can't be chumped easily, so it's not as ghastly as it may seem. I like this as a finisher, especially since they moved my favorite Wurm to rare.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Ghastbark Twins.png"},
{"title":"Ghirapur Guide","color":"green","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"If you want a 3/2 for 3, this certainly delivers. The activated ability isn't all that great because it's expensive and somewhat situational, but as an upside on a passable body you could do worse. This occupies a weird space of trying to be an aggressive green card with an ability that doesn't quite get there, and as a result most decks aren't that interested.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Ghirapur Guide.png"},
{"title":"Giant Spider","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"An Alpha throwback, Giant Spider has been great in green decks since 1993. This fits nicely into the plan of ramping out big creatures, and protects you from most threats in the air. It is relevant that Aven Wind Mage can beat it in a fight. When your common Spider can't beat the common Wind Drake, blue does have an edge.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Giant Spider.png"},
{"title":"Gift of Paradise","color":"green","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"fixing","review":"In a deck that wants this, it's one of the best cards. It fixes your colors, ramps you, and gives you a little life to play with. In a 2 color deck with a low to medium curve, it's not great, but more green decks will fall into the first camp. This ended up being awesome in Amonkhet/Hour Limited, and there are enough ramp payoffs that this will perform in this format too.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Gift of Paradise.png"},
{"title":"Gigantosaurus","color":"green","lowScore":"0","highScore":"3","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Unless you're mono-green, don't play this. Seriously, just don't. You need 14+ Forests for it to pull its (considerable) weight, and even then it's not a bomb. This is no Tempest Djinn, and is a gigantic pain to get to work properly.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Gigantosaurus.png"},
{"title":"Goreclaw, Terror of Qal Sisma","color":"green","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"The Terror does live up to its over-wrought name, as it attacks as a 5/4 trampler and makes your other big creatures cheaper and bigger. You don't need anything else for this to be great, and it won't be hard to find friends for it in any case.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Goreclaw, Terror of Qal Sisma.png"},
{"title":"Greenwood Sentinel","color":"green","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"If this ends up being more of a bear format, this will earn its 2.0 rating, but I wouldn't be surprised if this was a 1.5. Core sets tend to alternate between \"play all your bears\" and \"you need bigger cards to win\", so it'll be interesting to see where this lands. I suspect that G/W and R/G are likely to play this more often, with U/G and B/G largely leaving it on the sidelines. Vigilance isn't nothing, but it's not much, since this will perish most of the times it gets into combat.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Greenwood Sentinel.png"},
{"title":"Highland Game","color":"green","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"This, on the other hand, is a very small game. I'm not keen on 1 toughness creatures, and this looks like fodder to me. It is a passable sideboard card against an aggro deck full of 3/2s, but attacking with this is a fool's game.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Highland Game.png"},
{"title":"Hungering Hydra","color":"green","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"I had to read this cards a few times to make sure that I had it right-when it survives damage, it gets huge. There's no drawback, just reverse menace, and between this being good at most points on the curve and splashable, it's an excellent early pick. I know the hungering life, and can confirm this has what it takes.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Hungering Hydra.png"},
{"title":"Naturalize","color":"green","lowScore":"0.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"removal","face":"","fixing":"","review":"The format isn't extreme enough to push this into main decks, so it falls into its natural place as a sideboard card.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Naturalize.png"},
{"title":"Oakenform","color":"green","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Against a removal-light deck, this will often end the game. Against someone with bounce or removal, it will do the same, just in reverse. I'd avoid playing this in my main deck, though it's a decent sideboard card against decks that can't punish you for playing it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Oakenform.png"},
{"title":"Pelakka Wurm","color":"green","lowScore":"4.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"I love me a Pelakka Wurm, and I'm sad it's now a rare. The reason I'm so high on this is that it stabilizes with the 7 life, making it less risky to tap out for, and draws you a card when it dies, making it a good exchange against removal. Those two abilities shore up most of the problems 7-drops typically have, and leave you with an excellent finisher and ramp incentive.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Pelakka Wurm.png"},
{"title":"Plummet","color":"green","lowScore":"0.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"removal","face":"","fixing":"","review":"I'd always sideboard this in Draft and often main deck it in Sealed, especially if you're light on flying defense. Plummet is a great card to exist, and there's a reason something like it is printed in every set.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Plummet.png"},
{"title":"Prodigious Growth","color":"green","lowScore":"4","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"As much as I bag on Auras, I'm not opposed to playing them when they are game-winners. Prodigious Growth essentially is a 7/7 haste trampler for 6, with the requirement that you have a creature in play (and an upside of adding in that creature's stats). When this works, it's incredible, which is why I like it so much more than something like Oakenform. This still is vulnerable to instant-speed removal, but you end the game often enough when you cast this that sorcery-speed removal isn't as big a concern.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Prodigious Growth.png"},
{"title":"Rabid Bite","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"removal","face":"","fixing":"","review":"Green sometimes wants a fair fight and sometimes wants to fight dirty, with biting definitely in the latter camp. Rabid Bite is a solid piece of removal, though it will be more of a nibble against big creatures or in creature-light decks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Rabid Bite.png"},
{"title":"Reclamation Sage","color":"green","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"removal","face":"","fixing":"","review":"What vaults Sage past Naturalize is that the fail case here is a 2/1 for 3, which is at least a card. When this works, it's a huge upside, and when it doesn't, you can often trade it off, even if it's inefficient. That says a lot about the value of a card, and why this is a card I'll take early and play while Naturalize is a sideboard-only option.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Reclamation Sage.png"},
{"title":"Recollect","color":"green","lowScore":"0.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"The strength of Recollect is giving you another shot at a powerful card. The downsides are that it won't always have targets and that you're paying 3 mana on top of whatever the card originally cost. That's not enough to make this good, and I'd advise against it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Recollect.png"},
{"title":"Rhox Oracle","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"You can't play too many of these (sounds like a dare to me), but having 1-2 on the top of the curve will be lovely. You pull slightly ahead every time you cast one, and they rhox at trading for 4/4s. Their weakness is aggro, so make sure you have good defense if this is your plan.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Rhox Oracle.png"},
{"title":"Root Snare","color":"green","lowScore":"0.5","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"Cards like this (Fogs, after the original) are marginal sideboard cards at best, but they can be good against combat tricks and particularly Overruns (like Declare Dominance).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Root Snare.png"},
{"title":"Runic Armasaur","color":"green","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Runic Armasaur is sturdy, to say the least, and will make life difficult for the opponent. There are enough creatures with activated abilities that its text box is relevant, and it blocks well enough that I'd be happy to play it regardless.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Runic Armasaur.png"},
{"title":"Scapeshift","color":"green","lowScore":"0","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"fixing","review":"If you want to draft this for…collectability reasons (a.k.a. $$$), by all means do so, but don't expect it to do much in Limited. I guess it can thin your deck of lands, but that's a marginal upside for a 4 mana blank.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Scapeshift.png"},
{"title":"Talons of Wildwood","color":"green","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I won't want to pay 2 mana for +1/+1 and trample, even if I get to buy it back later. This is green's version of Equipment, and it's not effective enough to get me interested.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Talons of Wildwood.png"},
{"title":"Thorn Lieutenant","color":"green","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"This won't just be a thorn in the opponent's side, it'll be a whole bush. It attacks without fear early, plays like a 6/7 late, and punishes the opponent for trying to deal with it. It's good at every stage in the game, which is exactly what you want out of your cards.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Thorn Lieutenant.png"},
{"title":"Thornhide Wolves","color":"green","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"You can do worse for 5 mana, even if these aren't the most exciting beasts you could be summoning. Green has plenty of solid vanillas, and there's nothing wrong with playing a couple of ‘em.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Thornhide Wolves.png"},
{"title":"Titanic Growth","color":"green","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"instant","removal":"","face":"","fixing":"","review":"Titanic Growth checks a lot of boxes when it comes to what you want out of a trick: Not every deck wants combat tricks, and in particular the high curve green decks won't, but this is good in any beatdown or midrange deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Titanic Growth.png"},
{"title":"Vigilant Baloth","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"What does Vigilant Baloth do, I wonder? This is efficient enough that I'd always play it, and if you're lacking in beef, feel free to move it up the pick order. It defends nicely, and vigilance is good for defensive decks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Vigilant Baloth.png"},
{"title":"Vine Mare","color":"green","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I could easily see this being closer to a 3.5, at least once you have a couple Auras. It's vine by itself, but really gets going once you pants it up. Hey, I'll take the big hexproof things being uncommon, especially when the good Auras are uncommon as well. This is no Jade Guardian // One with the Wind situation.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Vine Mare.png"},
{"title":"Vivien Reid","color":"green","lowScore":"4","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"fixing","review":"Vivien Reid fits nicely in almost any green deck. She finds more creatures/lands while increasing an already-high loyalty, and can snipe opposing flyers if need be (plus handle pesky artifacts/enchantments). She isn't a busted planeswalker, but is a solid card that I'd always be happy to have. I'd like her a lot more if she defended herself against ground creatures, but luckily green is already good at doing that.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Vivien Reid.png"},
{"title":"Vivien's Invocation","color":"green","lowScore":"1.5","highScore":"3","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"In a dedicated ramp deck with a lot of solid creatures, this is a decent finisher. There's a natural tension between this and expensive creatures, as you can't just run 10 cards that cost 5+ mana, but if you have 4-6 good hits and 6-8 decent ones, this will be worth 7 mana.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Vivien's Invocation.png"},
{"title":"Wall of Vines","color":"green","lowScore":"0.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"I'd never main deck it, but I might side it against small flyers. Given how good most of the flyers are, this doesn't even seem good after board, but it might have some applications.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Wall of Vines.png"},
{"title":"Aerial Engineer","color":"white+blue","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Aerial Engineer is a solid body by itself, though not one you'd play without the upside. If you have 2-3 artifacts in your deck, this card is good, and at 4+ it becomes one of your better cards (and I'd adjust the rating up accordingly).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Aerial Engineer.png"},
{"title":"Arcades, the Strategist","color":"green+white+blue","lowScore":"3","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Arcades has committed some strategic errors in this set, as a splash card that triggers when you cast a defender is awkward when it comes down after all of the defenders. This is tough to build around, though some decks might be able to get there. If you've got a little mana fixing and 2+ defenders, this is playable, but it's nowhere near the bomb some of its brethen are.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Arcades, the Strategist.png"},
{"title":"Brawl-Bash Ogre","color":"black+red","lowScore":"3","highScore":"3.5","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"This is a great sacrifice outlet for Act of Treason, as it doesn't cost any mana to use and attacks quite well without a ton of support. It's always playable if you're black-red, and can really headline a sacrifice deck once you provide the necessary fodder. This is a build-around I wouldn't mind starting with, as the rewards are there.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Brawl-Bash Ogre.png"},
{"title":"Chromium, the Mutable","color":"white+blue+black","lowScore":"4.5","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Now this is more like it. Chromium is splashable, impossible to deal with (it dodges counters, removal, and is big enough that it won't die in combat often either), and finishes the game really quickly. If I was any two of these colors, I'd snap this up, and would be very happy first-picking Chromium despite it's tri-color requirements. It's fitting that an Elder Dragon is a huge bomb, and I'd be disappointed if it weren't.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Chromium, the Mutable.png"},
{"title":"Draconic Disciple","color":"red+green","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Draconic Disciple is the perfect ramp card. It fixes your colors, accelerates you, and once you're flush with mana, turns into a 5/5 flyer. That checks all the boxes I look for, and makes this one of the better gold cards in the set.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Draconic Disciple.png"},
{"title":"Enigma Drake","color":"blue+red","lowScore":"2","highScore":"3.5","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"The low end of the rating on this is a bit of a mirage because the people who want this are going to snap it up early enough that you aren't likely to see it super late. When you have 7+ spells, this is playable, and at 10+ it's just absurd. This was one of my favorite cards to build around in Amonkhet, and U/R Spells is a strong archetype in M19 as well.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Enigma Drake.png"},
{"title":"Heroic Reinforcements","color":"red+white","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"This card is a beating in an aggro deck. By itself, it brings two 2/2 haste creatures, and it'll often pump 2-3 other creatures as well. Curving into this on turn 5 or 6 is nigh-unbeatable, and at almost any point in the game it will be awesome. It's at its worst when your offense is halted, but even then it puts a decent amount of power on the board. It loses a lot of luster in defensive decks, so keep that in mind.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Heroic Reinforcements.png"},
{"title":"Nicol Bolas, the Ravager","color":"blue+black+red","lowScore":"4.5","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"While you don't get all the mileage possible out of this costing just 4 mana because you aren't often playing it turn 4, Nicol Bolas is still an amazing threat. It comes down, eats a card, and is a 4/4 flyer that threatens to turn into an unbeatable planeswalker. The Arisen has so much loyalty that the opponent is unlikely to be able to kill it, and the combination of killing the best creature, reanimating the best creature, or drawing two cards is a powerful one. There are few situations where this won't just win you the game.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Nicol Bolas, the Ravager.png"},
{"title":"Palladia-Mors, the Ruiner","color":"red+green+white","lowScore":"4.5","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Hexproof until it deals damage is a really neat text box-it's guaranteed to get a hit in (or a block-note that \"deals damage\" doesn't just mean to players), but the opponent can kill this afterwards. Palladia-Mors is still a beating, and a 6/6 flying, vigilance, trample is no joke. The fact that it lives when you tap out for it is huge, as that shores up one of the biggest weaknesses of huge creatures, and that pushes it to a 4.5.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Palladia-Mors, the Ruiner.png"},
{"title":"Poison-Tip Archer","color":"black+green","lowScore":"4","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Poison-Tip Archer is an absurd uncommon. Not only does it trade for anything, including sniping flyers, but the passive ability that pings the opponent is hugely threatening as the game goes on. There are some boards where this never attacks or blocks and still is the best creature out, especially since it triggers whenever any creature dies, whether it be yours or theirs. I'd splash this, and it's a great reason to go into B/G.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Poison-Tip Archer.png"},
{"title":"Psychic Symbiont","color":"blue+black","lowScore":"4","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Speaking of splashing, Symbiont is a great card to pick up if you're either of its colors. It has a huge impact on the game and is one of the easiest 3-for-1s you'll ever see. It doesn't take a psychic to figure out why I love this card, and it gets especially filthy if you can bounce this or return it from the graveyard.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Psychic Symbiont.png"},
{"title":"Regal Bloodlord","color":"white+black","lowScore":"3.5","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Regal Bloodlord is a medium-sized flyer that does a good job of dragging out the game, and there's enough incidental life gain that it will make a flyer or two without you even building your deck around it. When you do build your deck around it, it becomes awesome, and that makes this card a very safe bet.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Regal Bloodlord.png"},
{"title":"Satyr Enchanter","color":"green+white","lowScore":"1","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Building your deck around this might be an enchanting proposition, but it doesn't seem all that likely to happen. Filling your deck full of Auras isn't where you want to be, and you aren't picking up enough Luminous Bonds to satisfy the Satyr by itself. It is cute with Talons of Wildwood, but unless you pick up two Satyrs, I wouldn't go all-in on that strategy.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Satyr Enchanter.png"},
{"title":"Skyrider Patrol","color":"green+blue","lowScore":"4","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Ride or die is right, as this just runs over the opponent unless they stop it quickly. You hit for 5+ damage each turn, and the accumulated counters give you value even if they can halt your offense. This is splashable, but is much stronger in base blue-green because you can play this on turn 6 and immediately use the trigger.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Skyrider Patrol.png"},
{"title":"Vaevictis Asmadi, the Dire","color":"black+red+green","lowScore":"4.5","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"Your opponent will be in dire straights if you get to attack with this, and given that it's a 6/6 flyer, there aren't many ways for them to stop you. It even triggers on attacks, not damage, so there's no way they can assemble enough blockers to stop this. It is worth noting that it doesn't just kill their cards, as they can flip something sick, but it's still a highly advantageous trigger.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Vaevictis Asmadi, the Dire.png"},
{"title":"Amulet of Safekeeping","color":"artifact","lowScore":"0.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"I guess you could side this in against someone who makes a million Bat or Goblin tokens, but that seems very unlikely. This text box is a doozy, and is so clearly aimed at U/R Storm in Modern that you end up with a super awkward text box (and one that makes no sense to most people who read it, especially in a core set).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Amulet of Safekeeping.png"},
{"title":"Arcane Encyclopedia","color":"artifact","lowScore":"3","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"There are some decks that need this so badly they'll take it as if it were a 3.5 or even 4.0, but the format isn't quite slow enough for this to be a windmill slam bomb. If either player curves out, this is a little slow, though it will win any game where the owner stabilizes. It's great in Sealed, full stop, because decks are on balance quite slow and grindy-throwing the book at them is a great strategy.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Arcane Encyclopedia.png"},
{"title":"Chaos Wand","color":"artifact","lowScore":"1.5","highScore":"2.5","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"The rating here is basically nonsense because the range on this is so wide. Overall, I'd always main deck this in Sealed and tend to sideboard it in Draft, which makes it a 1.5 in Draft and a 3.5 in Sealed, but it is pretty wild. I crushed my first Sealed with it because everyone always plays 3+ pieces of removal in Sealed, but in Draft you could run up against a deck with all pump spells or whatever. I like this card, but would prefer to side it in against removal decks in Draft rather than main deck it.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Chaos Wand.png"},
{"title":"Crucible of Worlds","color":"artifact","lowScore":"0","highScore":"","set":"m19","rarity":"mythic","instant":"","removal":"","face":"","fixing":"","review":"You should both never play this in Limited and basically always first pick it, for \"collectability reasons.\" Actually, I'm allowed to say that cards are worth money here, so you should take it because it's worth a lot.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Crucible of Worlds.png"},
{"title":"Desecrated Tomb","color":"artifact","lowScore":"0","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"It seems like a stretch to get this going. You've got to go so deep on Macabre Waltz, and I just don't see that happening reliably enough.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Desecrated Tomb.png"},
{"title":"Diamond Mare","color":"artifact","lowScore":"0.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I'd sideboard this in against aggro, but otherwise would bet on a different horse (any of them). It just doesn't impact the board very much, and gaining a couple life isn't very exciting. The exception is in the life gain deck, where this provides a lot of triggers, but you'll know if you're in that deck.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Diamond Mare.png"},
{"title":"Dragon's Hoard","color":"artifact","lowScore":"2.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"I don't see this triggering all that often, but Manalith is a playable card in this format, and there are common and uncommon Dragons. This isn't as good as gold, but it's not unplayable either.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Dragon's Hoard.png"},
{"title":"Explosive Apparatus","color":"artifact","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"removal","face":"face","fixing":"","review":"This isn't exactly explosive, but it's a playable card if you're short on removal or cards in general. Much like all artifacts, it gets an upgrade if you're in the artifact deck, but it's annoying that you have to sacrifice this to get value from it because that deck likes artifacts sitting in play.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Explosive Apparatus.png"},
{"title":"Field Creeper","color":"artifact","lowScore":"1","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Aggro decks will sometimes play 2-mana 2/1s, and artifact decks won't mind creeping into this guy's DMs, but for the most part you won't want to field this as part of your starting lineup.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Field Creeper.png"},
{"title":"Fountain of Renewal","color":"artifact","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"In a normal deck, this isn't worth a card (even though it eventually replaces itself). In artifact decks or life gain decks, it's a fine way to get your synergies going.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Fountain of Renewal.png"},
{"title":"Gargoyle Sentinel","color":"artifact","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"Gargoyle Sentinel is unplayable in aggro decks and quite good in control or midrange decks, making it a card you'll play most of the time. Having to pay mana to attack is rough, but it can eventually finish things off and is a good-sized blocker.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Gargoyle Sentinel.png"},
{"title":"Gearsmith Guardian","color":"artifact","lowScore":"1.5","highScore":"3","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"This is pretty cute-it's an artifact that cares about blue cards, proving that the relationship goes both ways. This is a good reward for being in blue, and is a marginal playable outside of that.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Gearsmith Guardian.png"},
{"title":"Magistrate's Scepter","color":"artifact","lowScore":"0","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"Magistrate's Scepter takes way too long to pay off, and spending 15 mana to take an extra turn just isn't something you can do in Limited (or Constructed, for that matter).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Magistrate's Scepter.png"},
{"title":"Manalith","color":"artifact","lowScore":"2","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"Ramp decks and 3-color decks both want this, which makes it a solid card in the format. Your 2-color midrange or aggro decks aren't into it, so you can probably pick these up in the middle of the pack if you're in the market for them.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Manalith.png"},
{"title":"Marauder's Axe","color":"artifact","lowScore":"1.5","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"The effect here is powerful, but you can't just slot this into a deck and get good value. You want a way to make tokens or evasion creatures, or have a desperate need for artifacts.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Marauder's Axe.png"},
{"title":"Meteor Golem","color":"artifact","lowScore":"1.5","highScore":"3.5","set":"m19","rarity":"uncommon","instant":"","removal":"removal","face":"","fixing":"","review":"In a normal deck, this is a tad too expensive. In a dedicated ramp/control deck, this is an awesome finisher. I love when there are powerful cards that only some decks can use, and give them bonus points for being 7-mana Golems (I have a soft spot for those).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Meteor Golem.png"},
{"title":"Millstone","color":"artifact","lowScore":"1","highScore":"2.5","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I like this in a few spots: as a finisher in Sealed, as a sideboard card against control, and as an artifact/finisher in a controlling artifact-matters deck. Don't put this in a normal deck, and try and find better finishers for your Draft control decks. Milling them only helps them unless you kill them (since there are various graveyard synergies) and this doesn't combine with very many other cards when it comes to finishing the game. It's also not super fast, so you aren't racing with this.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Millstone.png"},
{"title":"Rogue's Gloves","color":"artifact","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"If you have a lot of Thopters (or other evasive creatures) this can lock up the game very quickly. In a deck with all ground pounders, it's not worth a card, so know when to put the gloves on (and when to take them off).","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Rogue's Gloves.png"},
{"title":"Sigiled Sword of Valeron","color":"artifact","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"I've gotten to jam this multiple times already, and it's pretty nice. Sometimes your opponent eats the 2/2 token you make and it's not too exciting, but sometimes they don't and you win on the spot. It pairs well with flyers and removal both, and can go into any creature-based deck and be very good.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Sigiled Sword of Valeron.png"},
{"title":"Skyscanner","color":"artifact","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"","review":"Given that this is colorless, an artifact, evasive, and combines with a ton of little synergies, it might actually be a 3.5. Either way, it's awesome, and I will be playing a ton of them.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Skyscanner.png"},
{"title":"Suspicious Bookcase","color":"artifact","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"I can't say enough good things about the flavor, even if the card is just fine. It's a good blocker in a control deck, and can eventually give you a way to finish things off.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Suspicious Bookcase.png"},
{"title":"Transmogrifying Wand","color":"artifact","lowScore":"3.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"removal","face":"","fixing":"","review":"There are some boards where this doesn't do much, and it's really bad in an aggro deck that attacks on the ground, but the effect is incredible in a control deck or a flyers deck. Downgrading three creatures into 2/4s is awesome, and if you have good blockers to corral those Oxen, this will be very close to triple-Terminate. The upside on this is high, and it's amazing if you build with it in mind.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Transmogrifying Wand.png"},
{"title":"Cinder Barrens","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Cinder Barrens.png"},
{"title":"Forsaken Sanctuary","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Forsaken Sanctuary.png"},
{"title":"Foul Orchard","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Foul Orchard.png"},
{"title":"Highland Lake","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Highland Lake.png"},
{"title":"Meandering River","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Meandering River.png"},
{"title":"Stone Quarry","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Stone Quarry.png"},
{"title":"Submerged Boneyard","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Submerged Boneyard.png"},
{"title":"Timber Gorge","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Timber Gorge.png"},
{"title":"Tranquil Expanse","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Tranquil Expanse.png"},
{"title":"Woodland Stream","color":"land","lowScore":"3","highScore":"","set":"m19","rarity":"common","instant":"","removal":"","face":"","fixing":"fixing","review":"You'll always play these and they help you splash, but they aren't ever going to be very high picks.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Woodland Stream.png"},
{"title":"Detection Tower","color":"land","lowScore":"0.5","highScore":"","set":"m19","rarity":"rare","instant":"","removal":"","face":"","fixing":"","review":"If you end up with this, it can be a fine sideboard option against Vine Mare or Palladia-Mors. That's not super common.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Detection Tower.png"},
{"title":"Reliquary Tower","color":"land","lowScore":"0","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"","review":"You should never end up in this position, and if you do, it's probably because you played a colorless land and are now color-screwed.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Reliquary Tower.png"},
{"title":"Rupture Spire","color":"land","lowScore":"2","highScore":"","set":"m19","rarity":"uncommon","instant":"","removal":"","face":"","fixing":"fixing","review":"I'd play this is 3-color decks, but would largely avoid it in 2-color ones.","imageUrl":"https://raw.githubusercontent.com/jakobmattsson/mtg-cards/master/images/m19/Rupture Spire.png"}
]